<template>
    <div class="container">
        <h2>Тестовое задание компании "Грузовичкоф"</h2>
        Напишите REST API для генерации рандомного числа.<br>
        Каждой генерации присваивать уникальный id по которому можно получить результат генерации.<br>
        Должны быть доступны 2 публичных API метода:<br>
        <ul>
            <li>generate() — вывод id и сгенерированного числа;</li>
            <li>retrieve(id) — вывод сгенерированного числа и даты-времени генерации.</li>
        </ul>
    </div>
</template>

<script>
    export default {
        name: "Home"
    }
</script>

<style scoped>

</style>
