app/Http/Controllers/API/NumbersController.php

    public function index()
    {
        $numbers = Number::all();
---
select * from `numbers`