app/Models/Number.php

    public static function createRandomNumber()
    {
        $number = new static;
        $number->value = rand(0, 999);
        $number->save();
---
insert into `numbers` (`value`, `updated_at`, `created_at`) values (558, '2020-09-20 10:08:07', '2020-09-20 10:08:07')